Repository: NtWriteCode/service-tracker
Catalog: lib/l10n/app_*.arb
Languages: hu

# appTitle
source: Service Tracker
hu: Szerviz Nyilvántartó

source: Home
hu: Főoldal

source: Services
hu: Szervizek

source: Reminders
hu: Emlékeztetők

source: Settings
hu: Beállítások

source: Current Mileage
hu: Jelenlegi kilométeróra állás

source: Update Mileage
hu: Kilométeróra frissítése

source: Register Mileage
hu: Kilométeróra rögzítése

source: Mileage
hu: Kilométeróra állás

source: Date
hu: Dátum

source: Place
hu: Hely

source: Items
hu: Tételek

source: Add Service
hu: Szerviz hozzáadása

source: New Service
hu: Új szerviz

source: Edit Service
hu: Szerviz szerkesztése

source: Delete Service
hu: Szerviz törlése

source: Service History
hu: Szerviz előzmények

source: Service Done
hu: Szerviz elvégezve

source: Add Reminder
hu: Emlékeztető hozzáadása

source: New Reminder
hu: Új emlékeztető

source: Edit Reminder
hu: Emlékeztető szerkesztése

source: Delete Reminder
hu: Emlékeztető törlése

source: Reminder Name
hu: Emlékeztető neve

source: Every (km)
hu: Minden (km)

source: Every (months)
hu: Minden (hónap)

source: Select Items
hu: Tételek kiválasztása

source: Service Items
hu: Szerviz tételek

source: Manage Items
hu: Tételek kezelése

source: Add Item
hu: Tétel hozzáadása

source: New Item
hu: Új tétel

source: Edit Item
hu: Tétel szerkesztése

source: Delete Item
hu: Tétel törlése

source: Item Name
hu: Tétel neve

source: Save
hu: Mentés

source: Cancel
hu: Mégse

source: Delete
hu: Törlés

source: Edit
hu: Szerkesztés

source: Confirm Delete
hu: Törlés megerősítése

# deleteServiceConfirm
source: Are you sure you want to delete this service?
hu: Biztosan törölni szeretnéd ezt a szervízt?

# deleteReminderConfirm
source: Are you sure you want to delete this reminder?
hu: Biztosan törölni szeretnéd ezt az emlékeztetőt?

# deleteItemConfirm
source: Are you sure you want to delete this item?
hu: Biztosan törölni szeretnéd ezt a tételt?

source: Yes
hu: Igen

source: No
hu: Nem

source: Upcoming Services
hu: Közelgő szervizek

source: No upcoming services
hu: Nincsenek közelgő szervizek

# noServices
source: No services yet
hu: Még nincsenek szervizek

# noReminders
source: No reminders yet
hu: Még nincsenek emlékeztetők

source: Due in
hu: Esedékes

source: Due at
hu: Esedékes

source: Overdue
hu: Lejárt

source: Language
hu: Nyelv

source: English
hu: Angol

source: Hungarian
hu: Magyar

source: Select Language
hu: Nyelv kiválasztása

source: Enter mileage
hu: Add meg a kilométeróra állást

# enterPlace
source: Enter place (e.g., mechanic shop)
hu: Add meg a helyet (pl. szerviz neve)

source: Select Date
hu: Dátum kiválasztása

source: Quantity
hu: Mennyiség

source: Price
hu: Ár

source: Total
hu: Összesen

source: Currency
hu: Pénznem

source: Select Currency
hu: Pénznem kiválasztása

source: Add Item to Service
hu: Tétel hozzáadása a szervizhez

source: Selected Items
hu: Kiválasztott tételek

source: No items selected
hu: Nincsenek kiválasztott tételek

# requiredField
source: This field is required
hu: Ez a mező kötelező

# invalidNumber
source: Please enter a valid number
hu: Kérlek adj meg egy érvényes számot

source: Mileage must be positive
hu: A kilométeróra állásnak pozitívnak kell lennie

# atLeastOneCondition
source: At least one condition (km or months) is required
hu: Legalább egy feltétel (km vagy hónap) szükséges

source: Last Service
hu: Utolsó szerviz

source: Next Due
hu: Következő esedékesség

source: or
hu: vagy

source: Use current location
hu: Jelenlegi hely használata

# locationServicesDisabled
source: Location services are disabled. Please enable them.
hu: A helymeghatározás ki van kapcsolva. Kérlek kapcsold be.

source: Location permission denied
hu: Helymeghatározási engedély megtagadva

# locationPermissionDeniedForever
source: Location permission permanently denied. Please enable it in settings.
hu: Helymeghatározási engedély véglegesen megtagadva. Kérlek engedélyezd a beállításokban.

# locationNotFound
source: Could not determine location
hu: Nem sikerült meghatározni a helyet

source: Error
hu: Hiba

source: Data Management
hu: Adatkezelés

# importDrivvo
source: Import from Drivvo
hu: Importálás Drivvo-ból

# importDrivvoDesc
source: Import service history from Drivvo CSV export
hu: Szerviz előzmények importálása Drivvo CSV exportból

source: Importing...
hu: Importálás folyamatban...

# importSuccess
source: Import successful
hu: Sikeres importálás

source: services imported
hu: szerviz importálva

# importError
source: Import failed
hu: Importálás sikertelen

source: Search or add item
hu: Keresés vagy tétel hozzáadása

source: Start typing...
hu: Kezdj el gépelni...

source: Custom
hu: Egyedi

# addAsCustomItem
source: Add "{name}" as custom item
hu: "{name}" hozzáadása egyedi tételként

source: Cars
hu: Autók

source: My Cars
hu: Autóim

source: Add Car
hu: Autó hozzáadása

source: New Car
hu: Új autó

source: Edit Car
hu: Autó szerkesztése

source: Delete Car
hu: Autó törlése

source: Car Name
hu: Autó neve

source: Plate Number
hu: Rendszám

source: Select Car
hu: Autó kiválasztása

# deleteCarConfirm
source: Are you sure you want to delete this car? All associated data will be deleted.
hu: Biztosan törölni szeretnéd ezt az autót? Minden kapcsolódó adat törlésre kerül.

# cannotDeleteLastCar
source: Cannot delete the last car
hu: Az utolsó autót nem lehet törölni

source: Enter car name
hu: Add meg az autó nevét

# enterPlateNumber
source: Enter plate number (optional)
hu: Add meg a rendszámot (opcionális)

# carNameRequired
source: Car name is required
hu: Az autó neve kötelező

source: Brand
hu: Márka

source: Select Brand
hu: Márka kiválasztása

source: Search brands...
hu: Márkák keresése...

source: No brand
hu: Nincs márka

source: Nickname
hu: Becenév

# enterNickname
source: Enter nickname (optional)
hu: Add meg a becenevet (opcionális)

# nicknameHint
source: e.g., Polo, Home car
hu: pl. Polo, Otthoni autó

source: WebDAV Sync
hu: WebDAV szinkronizálás

source: WebDAV Settings
hu: WebDAV beállítások

# webdavUsername
source: Username
hu: Felhasználónév

# webdavPassword
source: Password
hu: Jelszó

# webdavConnected
source: Connected
hu: Kapcsolódva

# webdavNotConnected
source: Not connected
hu: Nincs kapcsolat

# webdavLogin
source: Login
hu: Bejelentkezés

# webdavLogout
source: Logout
hu: Kijelentkezés

# webdavValidating
source: Validating connection...
hu: Kapcsolat ellenőrzése...

# webdavValidationSuccess
source: Connection successful
hu: Sikeres kapcsolódás

# webdavValidationFailed
source: Connection failed. Please check your credentials.
hu: Kapcsolódás sikertelen. Ellenőrizd a bejelentkezési adatokat.

# webdavAutoSync
source: Auto-sync
hu: Automatikus szinkronizálás

# webdavAutoSyncDesc
source: Automatically sync data after each change
hu: Automatikus adatszinkronizálás minden változtatás után

# webdavExport
source: Export to Server
hu: Exportálás a szerverre

# webdavImport
source: Import from Server
hu: Importálás a szerverről

# webdavExporting
source: Exporting...
hu: Exportálás folyamatban...

# webdavImporting
source: Importing...
hu: Importálás folyamatban...

# webdavExportSuccess
source: Export successful
hu: Sikeres exportálás

# webdavImportSuccess
source: Import successful
hu: Sikeres importálás

# webdavExportFailed
source: Export failed
hu: Exportálás sikertelen

# webdavImportFailed
source: Import failed
hu: Importálás sikertelen

# webdavSyncStatus
source: Sync Status
hu: Szinkronizálási állapot

# webdavFilesOnServer
source: Files on server
hu: Fájlok a szerveren

# enterWebdavUrl
source: Enter WebDAV URL (e.g., https://your-server.com/remote.php/dav/files/username/)
hu: Add meg a WebDAV URL-t (pl. https://sajat-szerver.com/remote.php/dav/files/felhasznalonev/)

source: Enter username
hu: Add meg a felhasználónevet

source: Enter password
hu: Add meg a jelszót

# webdavUrlRequired
source: WebDAV URL is required
hu: WebDAV URL megadása kötelező

# usernameRequired
source: Username is required
hu: Felhasználónév megadása kötelező

# passwordRequired
source: Password is required
hu: Jelszó megadása kötelező

# logoutConfirm
source: Are you sure you want to logout? This will not delete any local data.
hu: Biztosan ki szeretnél jelentkezni? Ez nem törli a helyi adatokat.
